InformationRegisters/МеткиВремениДанныхДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МеткиВремениДанныхДокументовЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияКлюча</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииДокументаЦентраЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МеткиВремениДанныхЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МеткиВремениДанныхЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииДокументаЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииДокументаЦентраЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлыСообщений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписиФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкиПодписей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>События</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/МеткиВремениДанныхДокументовЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ДанныеДокумента

// Параметры:
//  ИдентификаторДокументаЭДО - Строка
//  МеткаВремени - Число
// 
// Возвращаемое значение:
//  Структура:
//  * Сообщения - Массив из ДокументСсылка.СообщениеЭДО
//  * ФайлыСообщений - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ПодписиФайлов - ТаблицаЗначений:
//    ** ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    ** ПорядковыйНомер - Число
//  * ПроверкиПодписейПоМЧД - ТаблицаЗначений:
//    ** ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    ** ХешПодписи - Строка
Функция КлючиДанныхДокументаПоТипам(ИдентификаторДокументаЭДО, МеткаВремени) Экспорт
	
	Сообщения = Новый Массив; // Массив из ДокументСсылка.СообщениеЭДО
	ФайлыСообщений = Новый Массив; // Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	События = Новый Массив; // Массив из ПеречислениеСсылка.ТипыСобытийДокументаЦентраЭДО
	
	ПодписиФайлов = Новый ТаблицаЗначений;
	ПодписиФайлов.Колонки.Добавить("ПодписанныйОбъект",
		Новый ОписаниеТипов("СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы"));
	ПодписиФайлов.Колонки.Добавить("ПорядковыйНомер", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	ПроверкиПодписейПоМЧД = Новый ТаблицаЗначений;
	ПроверкиПодписейПоМЧД.Колонки.Добавить("ПодписанныйОбъект",
		Новый ОписаниеТипов("СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы"));
	ПроверкиПодписейПоМЧД.Колонки.Добавить("ХешПодписи", ОбщегоНазначения.ОписаниеТипаСтрока(32));
	
	КлючиДанныхПоТипам = Новый Структура;
	КлючиДанныхПоТипам.Вставить("Сообщения", Сообщения);
	КлючиДанныхПоТипам.Вставить("ФайлыСообщений", ФайлыСообщений);
	КлючиДанныхПоТипам.Вставить("ПодписиФайлов", ПодписиФайлов);
	КлючиДанныхПоТипам.Вставить("ПроверкиПодписейПоМЧД", ПроверкиПодписейПоМЧД);
	КлючиДанныхПоТипам.Вставить("События", События);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МеткиВремениДанныхДокументовЭДО.ТипДанных КАК ТипДанных,
		|	МеткиВремениДанныхДокументовЭДО.ИдентификаторДанных КАК ИдентификаторДанных,
		|	МеткиВремениДанныхДокументовЭДО.ЗначенияКлюча КАК ЗначенияКлюча
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхДокументовЭДО КАК МеткиВремениДанныхДокументовЭДО
		|ГДЕ
		|	МеткиВремениДанныхДокументовЭДО.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И МеткиВремениДанныхДокументовЭДО.МеткаВремени > &МеткаВремени";
	
	Запрос.УстановитьПараметр("МеткаВремени", МеткаВремени);
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокументаЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.Сообщения Тогда
			УникальныйИдентификатор = Новый УникальныйИдентификатор(Выборка.ИдентификаторДанных);
			Сообщение = Документы.СообщениеЭДО.ПолучитьСсылку(УникальныйИдентификатор);
			Сообщения.Добавить(Сообщение);
		ИначеЕсли Выборка.ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ФайлыСообщений Тогда
			УникальныйИдентификатор = Новый УникальныйИдентификатор(Выборка.ИдентификаторДанных);
			ФайлСообщения = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПолучитьСсылку(УникальныйИдентификатор);
			ФайлыСообщений.Добавить(ФайлСообщения);
		ИначеЕсли Выборка.ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПодписиФайлов Тогда
			ЗначенияКлюча = Выборка.ЗначенияКлюча.Получить(); // см. ЗначенияКлючаЗаписиЭлектроннойПодписи
			ФайлСообщения = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПолучитьСсылку(ЗначенияКлюча.ПодписанныйОбъект);
			ПодписьФайла = ПодписиФайлов.Добавить();
			ПодписьФайла.ПодписанныйОбъект = ФайлСообщения;
			ПодписьФайла.ПорядковыйНомер = ЗначенияКлюча.ПорядковыйНомер;
		ИначеЕсли Выборка.ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПроверкиПодписей Тогда
			ЗначенияКлюча = Выборка.ЗначенияКлюча.Получить(); // см. ЗначенияКлючаЗаписиЭлектроннойПодписиПоМЧД
			ФайлСообщения = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПолучитьСсылку(ЗначенияКлюча.ПодписанныйОбъект);
			ПроверкаПодписи = ПроверкиПодписейПоМЧД.Добавить();
			ПроверкаПодписи.ПодписанныйОбъект = ФайлСообщения;
			ПроверкаПодписи.ХешПодписи = ЗначенияКлюча.ХешПодписи;
		ИначеЕсли Выборка.ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.События Тогда
			Событие = Перечисления.ТипыСобытийДокументаЦентраЭДО.ЗначениеПоИдентификатору(
				Выборка.ИдентификаторДанных);
			События.Добавить(Событие);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КлючиДанныхПоТипам;
	
КонецФункции

#КонецОбласти

#Область ЗафиксироватьПоОбъекту

// Параметры:
//  Источник - ДокументОбъект.СообщениеЭДО,СправочникОбъект.СообщениеЭДОПрисоединенныеФайлы
Процедура ЗафиксироватьПоОбъекту(Источник) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект.СообщениеЭДО") Тогда
		ЗафиксироватьПоОбъектуДляСообщения(Источник);
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.СообщениеЭДОПрисоединенныеФайлы") Тогда
		ЗафиксироватьПоОбъектуДляФайлаСообщения(Источник);
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось зафиксировать метку времени. Неизвестный источник данных: %1'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - ДокументОбъект.СообщениеЭДО
Процедура ЗафиксироватьПоОбъектуДляСообщения(Источник)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.ЭлектронныйДокумент,
		"ИдентификаторОрганизации, ИдентификаторДокумента");
	ИдентификаторДанных = Строка(Источник.Ссылка.УникальныйИдентификатор());
	Записать(ЗначенияРеквизитов.ИдентификаторОрганизации, ЗначенияРеквизитов.ИдентификаторДокумента,
		Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.Сообщения, ИдентификаторДанных);
	
КонецПроцедуры

// Параметры:
//  Источник - СправочникОбъект.СообщениеЭДОПрисоединенныеФайлы
Процедура ЗафиксироватьПоОбъектуДляФайлаСообщения(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ЭлектронныйДокумент.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	СообщениеЭДО.ЭлектронныйДокумент.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.ВладелецФайла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторДанных = Строка(Источник.Ссылка.УникальныйИдентификатор());
	Записать(Выборка.ИдентификаторОрганизации, Выборка.ИдентификаторДокумента,
		Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ФайлыСообщений, ИдентификаторДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ЗафиксироватьПоНаборуЗаписей

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписи
//           - РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписей(Источник, Замещение) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ЭлектронныеПодписи") Тогда
		ЗафиксироватьПоНаборуЗаписейДляПодписейФайлов(Источник, Замещение);
	ИначеЕсли ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД") Тогда
		ЗафиксироватьПоНаборуЗаписейДляПроверокПодписей(Источник, Замещение);
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось зафиксировать метку времени. Неизвестный источник данных: %1'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписи
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписейДляПодписейФайлов(Источник, Замещение)
	
	Если ЗафиксироватьПоНаборуЗаписейСОтборомДляПодписейФайлов(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПодписейФайлов(Источник);
	Иначе
		ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПодписейФайлов(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПодписейФайлов.Источник
// 
// Возвращаемое значение:
//  Булево
Функция ЗафиксироватьПоНаборуЗаписейСОтборомДляПодписейФайлов(Источник)
	
	ПодписанныйОбъект = Источник.Отбор.ПодписанныйОбъект.Значение; // СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	ПорядковыйНомер = Источник.Отбор.ПорядковыйНомер.Значение; // Число
	Если Не ЗначениеЗаполнено(ПодписанныйОбъект)
		Или Не ЗначениеЗаполнено(ПорядковыйНомер) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваДокумента = СвойстваДокументаПоФайлу(ПодписанныйОбъект);
	
	Если ЗначениеЗаполнено(СвойстваДокумента) Тогда
		ЗначенияКлюча = ЗначенияКлючаЗаписиЭлектроннойПодписи(ПодписанныйОбъект, ПорядковыйНомер);
		ИдентификаторДанных = ИдентификаторКлючаЗаписи(ЗначенияКлюча);
		Записать(СвойстваДокумента.ИдентификаторОрганизации, СвойстваДокумента.ИдентификаторДокумента,
			Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПодписиФайлов, ИдентификаторДанных, ЗначенияКлюча);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ФайлСообщения - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
// 
// Возвращаемое значение:
//  Неопределено,Структура:
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторДокумента - Строка
Функция СвойстваДокументаПоФайлу(ФайлСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации,
		|		ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации) КАК ИдентификаторОрганизации,
		|	ЕСТЬNULL(ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента,
		|		ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента) КАК ИдентификаторДокумента
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|		И ПрисоединенныеФайлы.Ссылка = &Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
		|ГДЕ
		|	ПрисоединенныеФайлы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ФайлСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ИдентификаторОрганизации", Выборка.ИдентификаторОрганизации);
	Свойства.Вставить("ИдентификаторДокумента", Выборка.ИдентификаторДокумента);
	
	Возврат Свойства;
	
КонецФункции

// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ПорядковыйНомер - Число
// 
// Возвращаемое значение:
//  Структура:
//  * ПодписанныйОбъект - УникальныйИдентификатор
//  * ПорядковыйНомер - Число
Функция ЗначенияКлючаЗаписиЭлектроннойПодписи(ПодписанныйОбъект, ПорядковыйНомер)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("ПодписанныйОбъект", ПодписанныйОбъект.УникальныйИдентификатор());
	ЗначенияКлюча.Вставить("ПорядковыйНомер", ПорядковыйНомер);
	Возврат ЗначенияКлюча;
	
КонецФункции

// Параметры:
//  ЗначенияКлюча - Структура
//
// Возвращаемое значение:
//  Строка
Функция ИдентификаторКлючаЗаписи(ЗначенияКлюча)
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(XMLСтрока(Новый ХранилищеЗначения(ЗначенияКлюча, Новый СжатиеДанных(0))));
	Хеш = СтрЗаменить(Строка(Хеширование.ХешСумма), " ", "");
	Хеширование = Неопределено;
	
	Возврат СтрШаблон("%1-%2-%3-%4-%5",
		Лев(Хеш, 8), Сред(Хеш, 9, 4), Сред(Хеш, 13, 4), Сред(Хеш, 17, 4), Сред(Хеш, 21));
	
КонецФункции

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПодписейФайлов.Источник
Процедура ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПодписейФайлов(Источник)
	
	ВыгрузкаИзменений = ВыгрузкаИзмененийПоНаборуЗаписейДляПодписейФайлов(Источник);
	Если Не ЗначениеЗаполнено(ВыгрузкаИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПодписейФайлов(ВыгрузкаИзменений);
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПодписейФайлов.Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//  * ПорядковыйНомер - Число
Функция ВыгрузкаИзмененийПоНаборуЗаписейДляПодписейФайлов(Источник)
	
	Возврат МеткиВремениДанныхЭДО.ВыгрузкаИзмененийПоНаборуЗаписей(Источник);
	
КонецФункции

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписи
//           - см. ВыгрузкаИзмененийПоНаборуЗаписейДляПодписейФайлов
Процедура ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПодписейФайлов(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПодписиФайлов;
	СвойстваДокументаПоФайлам = Новый Соответствие;
	
	Для Каждого ЗаписьНабора Из Источник Цикл
		
		ПодписанныйОбъект = ЗаписьНабора.ПодписанныйОбъект;
		СвойстваДокумента = СвойстваДокументаПоФайлам[ПодписанныйОбъект];
		Если СвойстваДокумента = Неопределено Тогда
			СвойстваДокумента = СвойстваДокументаПоФайлу(ПодписанныйОбъект);
			СвойстваДокументаПоФайлам.Вставить(ПодписанныйОбъект, СвойстваДокумента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвойстваДокумента) Тогда
			ЗначенияКлюча = ЗначенияКлючаЗаписиЭлектроннойПодписи(ПодписанныйОбъект, ЗаписьНабора.ПорядковыйНомер);
			ИдентификаторДанных = ИдентификаторКлючаЗаписи(ЗначенияКлюча);
			Записать(СвойстваДокумента.ИдентификаторОрганизации, СвойстваДокумента.ИдентификаторДокумента,
				ТипДанных, ИдентификаторДанных, ЗначенияКлюча);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписейДляПроверокПодписей(Источник, Замещение)
	
	Если ЗафиксироватьПоНаборуЗаписейСОтборомДляПроверокПодписей(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПроверокПодписей(Источник);
	Иначе
		ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПроверокПодписей(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПроверокПодписей.Источник
// 
// Возвращаемое значение:
//  Булево
Функция ЗафиксироватьПоНаборуЗаписейСОтборомДляПроверокПодписей(Источник)
	
	ПодписанныйОбъект = Источник.Отбор.ПодписанныйОбъект.Значение; // СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	ХешПодписи = Источник.Отбор.ХешПодписи.Значение; // Строка
	Если Не ЗначениеЗаполнено(ПодписанныйОбъект)
		Или Не ЗначениеЗаполнено(ХешПодписи) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваДокумента = СвойстваДокументаПоФайлу(ПодписанныйОбъект);
	
	Если ЗначениеЗаполнено(СвойстваДокумента) Тогда
		ЗначенияКлюча = ЗначенияКлючаЗаписиЭлектроннойПодписиПоМЧД(ПодписанныйОбъект, ХешПодписи);
		ИдентификаторДанных = ИдентификаторКлючаЗаписи(ЗначенияКлюча);
		Записать(СвойстваДокумента.ИдентификаторОрганизации, СвойстваДокумента.ИдентификаторДокумента,
			Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПроверкиПодписей, ИдентификаторДанных,
			ЗначенияКлюча);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ПодписанныйОбъект - УникальныйИдентификатор
//  * ХешПодписи - Строка
Функция ЗначенияКлючаЗаписиЭлектроннойПодписиПоМЧД(ПодписанныйОбъект, ХешПодписи)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("ПодписанныйОбъект", ПодписанныйОбъект.УникальныйИдентификатор());
	ЗначенияКлюча.Вставить("ХешПодписи", ХешПодписи);
	Возврат ЗначенияКлюча;
	
КонецФункции

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПроверокПодписей.Источник
Процедура ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПроверокПодписей(Источник)
	
	ВыгрузкаИзменений = ВыгрузкаИзмененийПоНаборуЗаписейДляПроверокПодписей(Источник);
	Если Не ЗначениеЗаполнено(ВыгрузкаИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПроверокПодписей(ВыгрузкаИзменений);
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПроверокПодписей.Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//  * ХешПодписи - Строка
Функция ВыгрузкаИзмененийПоНаборуЗаписейДляПроверокПодписей(Источник)
	
	Возврат МеткиВремениДанныхЭДО.ВыгрузкаИзмененийПоНаборуЗаписей(Источник);
	
КонецФункции

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД
//           - см. ВыгрузкаИзмененийПоНаборуЗаписейДляПроверокПодписей
Процедура ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПроверокПодписей(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.ПроверкиПодписей;
	СвойстваДокументаПоФайлам = Новый Соответствие;
	
	Для Каждого ЗаписьНабора Из Источник Цикл
		
		ПодписанныйОбъект = ЗаписьНабора.ПодписанныйОбъект;
		СвойстваДокумента = СвойстваДокументаПоФайлам[ПодписанныйОбъект];
		Если СвойстваДокумента = Неопределено Тогда
			СвойстваДокумента = СвойстваДокументаПоФайлу(ПодписанныйОбъект);
			СвойстваДокументаПоФайлам.Вставить(ПодписанныйОбъект, СвойстваДокумента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвойстваДокумента) Тогда
			ЗначенияКлюча = ЗначенияКлючаЗаписиЭлектроннойПодписиПоМЧД(ПодписанныйОбъект, ЗаписьНабора.ХешПодписи);
			ИдентификаторДанных = ИдентификаторКлючаЗаписи(ЗначенияКлюча);
			Записать(СвойстваДокумента.ИдентификаторОрганизации, СвойстваДокумента.ИдентификаторДокумента,
				ТипДанных, ИдентификаторДанных, ЗначенияКлюча);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗафиксироватьПоТипуСобытияДокументаЭДО

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ТипСобытия - ПеречислениеСсылка.ТипыСобытийДокументаЦентраЭДО
Процедура ЗафиксироватьПоТипуСобытияДокументаЭДО(ЭлектронныйДокумент, ТипСобытия) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"ИдентификаторОрганизации, ИдентификаторДокумента");
	ИдентификаторДанных = Перечисления.ТипыСобытийДокументаЦентраЭДО.УникальныйИдентификатор(ТипСобытия);
	Записать(ЗначенияРеквизитов.ИдентификаторОрганизации, ЗначенияРеквизитов.ИдентификаторДокумента,
		Перечисления.ТипыСинхронизацииДокументаЦентраЭДО.События, ИдентификаторДанных);
	
КонецПроцедуры

#КонецОбласти

#Область Записать

// Параметры:
//  ИдентификаторЭДО - Строка
//  ИдентификаторДокумента - См. РегистрСведений.МеткиВремениДанныхДокументовЭДО.ИдентификаторДокумента
//  ТипДанныхДокумента - См. РегистрСведений.МеткиВремениДанныхДокументовЭДО.ТипДанных
//  ИдентификаторДанных - См. РегистрСведений.МеткиВремениДанныхДокументовЭДО.ИдентификаторДанных
//  ЗначениеКлюча - Неопределено
//                - см. ЗначенияКлючаЗаписиЭлектроннойПодписи
Процедура Записать(ИдентификаторЭДО, ИдентификаторДокумента, ТипДанныхДокумента, ИдентификаторДанных, ЗначениеКлюча = Неопределено)
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО;
	НаборЗаписей = РегистрыСведений.МеткиВремениДанныхЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторДокумента);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.ТипДанных = ТипДанных;
	ЗаписьНабора.ИдентификаторОбъекта = ИдентификаторДокумента;
	
	НаборЗаписейДокумента = СоздатьНаборЗаписей();
	НаборЗаписейДокумента.Отбор.ИдентификаторДокумента.Установить(ИдентификаторДокумента);
	НаборЗаписейДокумента.Отбор.ТипДанных.Установить(ТипДанныхДокумента);
	НаборЗаписейДокумента.Отбор.ИдентификаторДанных.Установить(ИдентификаторДанных);
	
	ЗаписьНабораДокумента = НаборЗаписейДокумента.Добавить();
	ЗаписьНабораДокумента.ИдентификаторДокумента = ИдентификаторДокумента;
	ЗаписьНабораДокумента.ТипДанных = ТипДанныхДокумента;
	ЗаписьНабораДокумента.ИдентификаторДанных = ИдентификаторДанных;
	Если ЗначениеКлюча <> Неопределено Тогда
		ЗаписьНабораДокумента.ЗначенияКлюча = Новый ХранилищеЗначения(ЗначениеКлюча, Новый СжатиеДанных(9));
	КонецЕсли;
	
	МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьНабора.МеткаВремени = МеткаВремени;
	ЗаписьНабораДокумента.МеткаВремени = МеткаВремени;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей.Записать();
		НаборЗаписейДокумента.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
